apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_pll.h
/*********************************************************************************
 * arch/arm/src/imxrt/hardware/rt117x/imxrt117x_pll.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 *********************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_PLL_H
#define __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_PLL_H

/*********************************************************************************
 * Included Files
 *********************************************************************************/

#include <nuttx/config.h>
#include "hardware/imxrt_memorymap.h"

/*********************************************************************************
 * Pre-processor Definitions
 *********************************************************************************/

/* ANADIG_PLL Register Offsets ***************************************************/
#define IMXRT_ANADIG_PLL_ARM_PLL_CTRL_OFFSET           (0x0200)
#define IMXRT_ANADIG_PLL_SYS_PLL3_CTRL_OFFSET          (0x0210)
#define IMXRT_ANADIG_PLL_SYS_PLL3_UPDATE_OFFSET        (0x0220)
#define IMXRT_ANADIG_PLL_SYS_PLL3_PFD_OFFSET           (0x0230)
#define IMXRT_ANADIG_PLL_SYS_PLL2_CTRL_OFFSET          (0x0240)
#define IMXRT_ANADIG_PLL_SYS_PLL2_UPDATE_OFFSET        (0x0250)
#define IMXRT_ANADIG_PLL_SYS_PLL2_SS_OFFSET            (0x0260)
#define IMXRT_ANADIG_PLL_SYS_PLL2_PFD_OFFSET           (0x0270)
#define IMXRT_ANADIG_PLL_SYS_PLL2_MFD_OFFSET           (0x02a0)
#define IMXRT_ANADIG_PLL_SYS_PLL1_SS_OFFSET            (0x02b0)
#define IMXRT_ANADIG_PLL_SYS_PLL1_CTRL_OFFSET          (0x02c0)
#define IMXRT_ANADIG_PLL_SYS_PLL1_DENOMINATOR_OFFSET   (0x02d0)
#define IMXRT_ANADIG_PLL_SYS_PLL1_NUMERATOR_OFFSET     (0x02e0)
#define IMXRT_ANADIG_PLL_SYS_PLL1_DIV_SELECT_OFFSET    (0x02f0)
#define IMXRT_ANADIG_PLL_PLL_AUDIO_CTRL_OFFSET         (0x0300)
#define IMXRT_ANADIG_PLL_PLL_AUDIO_SS_OFFSET           (0x0310)
#define IMXRT_ANADIG_PLL_PLL_AUDIO_DENOMINATOR_OFFSET  (0x0320)
#define IMXRT_ANADIG_PLL_PLL_AUDIO_NUMERATOR_OFFSET    (0x0330)
#define IMXRT_ANADIG_PLL_PLL_AUDIO_DIV_SELECT_OFFSET   (0x0340)
#define IMXRT_ANADIG_PLL_PLL_VIDEO_CTRL_OFFSET         (0x0350)
#define IMXRT_ANADIG_PLL_PLL_VIDEO_SS_OFFSET           (0x0360)
#define IMXRT_ANADIG_PLL_PLL_VIDEO_DENOMINATOR_OFFSET  (0x0370)
#define IMXRT_ANADIG_PLL_PLL_VIDEO_NUMERATOR_OFFSET    (0x0380)
#define IMXRT_ANADIG_PLL_PLL_VIDEO_DIV_SELECT_OFFSET   (0x0390)

/* ANADIG_PLL Register Addresses *************************************************/
#define IMXRT_ANADIG_PLL_ARM_PLL_CTRL           (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_ARM_PLL_CTRL_OFFSET)
#define IMXRT_ANADIG_PLL_SYS_PLL3_CTRL          (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_SYS_PLL3_CTRL_OFFSET)
#define IMXRT_ANADIG_PLL_SYS_PLL3_UPDATE        (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_SYS_PLL3_UPDATE_OFFSET)
#define IMXRT_ANADIG_PLL_SYS_PLL3_PFD           (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_SYS_PLL3_PFD_OFFSET)
#define IMXRT_ANADIG_PLL_SYS_PLL2_CTRL          (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_SYS_PLL2_CTRL_OFFSET)
#define IMXRT_ANADIG_PLL_SYS_PLL2_UPDATE        (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_SYS_PLL2_UPDATE_OFFSET)
#define IMXRT_ANADIG_PLL_SYS_PLL2_SS            (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_SYS_PLL2_SS_OFFSET)
#define IMXRT_ANADIG_PLL_SYS_PLL2_PFD           (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_SYS_PLL2_PFD_OFFSET)
#define IMXRT_ANADIG_PLL_SYS_PLL2_MFD           (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_SYS_PLL2_MFD_OFFSET)
#define IMXRT_ANADIG_PLL_SYS_PLL1_SS            (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_SYS_PLL1_SS_OFFSET)
#define IMXRT_ANADIG_PLL_SYS_PLL1_CTRL          (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_SYS_PLL1_CTRL_OFFSET)
#define IMXRT_ANADIG_PLL_SYS_PLL1_DENOMINATOR   (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_SYS_PLL1_DENOMINATOR_OFFSET)
#define IMXRT_ANADIG_PLL_SYS_PLL1_NUMERATOR     (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_SYS_PLL1_NUMERATOR_OFFSET)
#define IMXRT_ANADIG_PLL_SYS_PLL1_DIV_SELECT    (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_SYS_PLL1_DIV_SELECT_OFFSET)
#define IMXRT_ANADIG_PLL_PLL_AUDIO_CTRL         (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_PLL_AUDIO_CTRL_OFFSET)
#define IMXRT_ANADIG_PLL_PLL_AUDIO_SS           (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_PLL_AUDIO_SS_OFFSET)
#define IMXRT_ANADIG_PLL_PLL_AUDIO_DENOMINATOR  (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_PLL_AUDIO_DENOMINATOR_OFFSET)
#define IMXRT_ANADIG_PLL_PLL_AUDIO_NUMERATOR    (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_PLL_AUDIO_NUMERATOR_OFFSET)
#define IMXRT_ANADIG_PLL_PLL_AUDIO_DIV_SELECT   (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_PLL_AUDIO_DIV_SELECT_OFFSET)
#define IMXRT_ANADIG_PLL_PLL_VIDEO_CTRL         (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_PLL_VIDEO_CTRL_OFFSET)
#define IMXRT_ANADIG_PLL_PLL_VIDEO_SS           (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_PLL_VIDEO_SS_OFFSET)
#define IMXRT_ANADIG_PLL_PLL_VIDEO_DENOMINATOR  (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_PLL_VIDEO_DENOMINATOR_OFFSET)
#define IMXRT_ANADIG_PLL_PLL_VIDEO_NUMERATOR    (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_PLL_VIDEO_NUMERATOR_OFFSET)
#define IMXRT_ANADIG_PLL_PLL_VIDEO_DIV_SELECT   (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PLL_PLL_VIDEO_DIV_SELECT_OFFSET)

