apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_pll.h
/* ARM_PLL_CTRL_REGISTER (ARM_PLL_CTRL) */
#define ANADIG_PLL_ARM_PLL_CTRL_DIV_SELECT_SHIFT      (0)        /* Bits 0-8: DIV_SELECT */
#define ANADIG_PLL_ARM_PLL_CTRL_DIV_SELECT_MASK       (0xFF << ANADIG_PLL_ARM_PLL_CTRL_DIV_SELECT_SHIFT)
#define ANADIG_PLL_ARM_PLL_CTRL_DIV_SELECT(n)         (((n) << ANADIG_PLL_ARM_PLL_CTRL_DIV_SELECT_SHIFT) & ANADIG_PLL_ARM_PLL_CTRL_DIV_SELECT_MASK)
#define ANADIG_PLL_ARM_PLL_CTRL_HOLD_RING_OFF         (1 << 12)  /* Bit 12: PLL Start up initialization */
#define ANADIG_PLL_ARM_PLL_CTRL_POWERUP               (1 << 13)  /* Bit 13: Powers up the PLL. */
#define ANADIG_PLL_ARM_PLL_CTRL_ENABLE_CLK            (1 << 14)  /* Bit 14: Enable the clock output. */
#define ANADIG_PLL_ARM_PLL_CTRL_POST_DIV_SEL_SHIFT    (15)       /* Bits 15-17: POST_DIV_SEL */
#define ANADIG_PLL_ARM_PLL_CTRL_POST_DIV_SEL_MASK     (0x3 << ANADIG_PLL_ARM_PLL_CTRL_POST_DIV_SEL_SHIFT)
#define ANADIG_PLL_ARM_PLL_CTRL_POST_DIV_SEL(n)       (((n) << ANADIG_PLL_ARM_PLL_CTRL_POST_DIV_SEL_SHIFT) & ANADIG_PLL_ARM_PLL_CTRL_POST_DIV_SEL_MASK)
#define ANADIG_PLL_ARM_PLL_CTRL_BYPASS                (1 << 17)  /* Bit 17: Bypass the pll. */
#define ANADIG_PLL_ARM_PLL_CTRL_ARM_PLL_STABLE        (1 << 29)  /* Bit 29: ARM_PLL_STABLE */
#define ANADIG_PLL_ARM_PLL_CTRL_ARM_PLL_GATE          (1 << 30)  /* Bit 30: ARM_PLL_GATE */
#define ANADIG_PLL_ARM_PLL_CTRL_ARM_PLL_CONTROL_MODE  (1 << 31)  /* Bit 31: pll_arm_control_mode */

/* SYS_PLL3_CTRL_REGISTER (SYS_PLL3_CTRL) */
#define ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_DIV2               (1 << 3)   /* Bit 3: SYS PLL3 DIV2 gate */
#define ANADIG_PLL_SYS_PLL3_CTRL_PLL_REG_EN                  (1 << 4)   /* Bit 4: Enable Internal PLL Regulator */
#define ANADIG_PLL_SYS_PLL3_CTRL_HOLD_RING_OFF               (1 << 11)  /* Bit 11: PLL Start up initialization */
#define ANADIG_PLL_SYS_PLL3_CTRL_ENABLE_CLK                  (1 << 13)  /* Bit 13: Enable the clock output. */
#define ANADIG_PLL_SYS_PLL3_CTRL_BYPASS                      (1 << 16)  /* Bit 16: BYPASS */
#define ANADIG_PLL_SYS_PLL3_CTRL_POWERUP                     (1 << 21)  /* Bit 21: Powers up the PLL. */
#define ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_DIV2_CONTROL_MODE  (1 << 28)  /* Bit 28: SYS_PLL3_DIV2_CONTROL_MODE */
#define ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_STABLE             (1 << 29)  /* Bit 29: SYS_PLL3_STABLE */
#define ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_GATE               (1 << 30)  /* Bit 30: SYS_PLL3_GATE */
#define ANADIG_PLL_SYS_PLL3_CTRL_SYS_PLL3_CONTROL_MODE       (1 << 31)  /* Bit 31: SYS_PLL3_control_mode */

/* SYS_PLL3_UPDATE_REGISTER (SYS_PLL3_UPDATE) */
#define ANADIG_PLL_SYS_PLL3_UPDATE_PFD0_UPDATE        (1 << 1)  /* Bit 1: PFD0_OVERRIDE */
#define ANADIG_PLL_SYS_PLL3_UPDATE_PFD1_UPDATE        (1 << 2)  /* Bit 2: PFD1_OVERRIDE */
#define ANADIG_PLL_SYS_PLL3_UPDATE_PFD2_UPDATE        (1 << 3)  /* Bit 3: PFD2_OVERRIDE */
#define ANADIG_PLL_SYS_PLL3_UPDATE_PFD3_UPDATE        (1 << 4)  /* Bit 4: PFD3_UPDATE */
#define ANADIG_PLL_SYS_PLL3_UPDATE_PFD0_CONTROL_MODE  (1 << 5)  /* Bit 5: pfd0_control_mode */
#define ANADIG_PLL_SYS_PLL3_UPDATE_PFD1_CONTROL_MODE  (1 << 6)  /* Bit 6: pfd1_control_mode */
#define ANADIG_PLL_SYS_PLL3_UPDATE_PDF2_CONTROL_MODE  (1 << 7)  /* Bit 7: pdf2_control_mode */
#define ANADIG_PLL_SYS_PLL3_UPDATE_PFD3_CONTROL_MODE  (1 << 8)  /* Bit 8: pfd3_control_mode */

/* SYS_PLL3_PFD_REGISTER (SYS_PLL3_PFD) */
#define ANADIG_PLL_SYS_PLL3_PFD_PFD0_FRAC_SHIFT    (0)        /* Bits 0-6: PFD0_FRAC */
#define ANADIG_PLL_SYS_PLL3_PFD_PFD0_FRAC_MASK     (0x3F << ANADIG_PLL_SYS_PLL3_PFD_PFD0_FRAC_SHIFT)
#define ANADIG_PLL_SYS_PLL3_PFD_PFD0_FRAC(n)       (((n) << ANADIG_PLL_SYS_PLL3_PFD_PFD0_FRAC_SHIFT) & ANADIG_PLL_SYS_PLL3_PFD_PFD0_FRAC_MASK)
#define ANADIG_PLL_SYS_PLL3_PFD_PFD0_STABLE        (1 << 6)   /* Bit 6: PFD0_STABLE */
#define ANADIG_PLL_SYS_PLL3_PFD_PFD0_DIV1_CLKGATE  (1 << 7)   /* Bit 7: PFD0_DIV1_CLKGATE */
#define ANADIG_PLL_SYS_PLL3_PFD_PFD1_FRAC_SHIFT    (8)        /* Bits 8-14: PFD1_FRAC */
#define ANADIG_PLL_SYS_PLL3_PFD_PFD1_FRAC_MASK     (0x3F << ANADIG_PLL_SYS_PLL3_PFD_PFD1_FRAC_SHIFT)
#define ANADIG_PLL_SYS_PLL3_PFD_PFD1_FRAC(n)       (((n) << ANADIG_PLL_SYS_PLL3_PFD_PFD1_FRAC_SHIFT) & ANADIG_PLL_SYS_PLL3_PFD_PFD1_FRAC_MASK)
#define ANADIG_PLL_SYS_PLL3_PFD_PFD1_STABLE        (1 << 14)  /* Bit 14: PFD1_STABLE */
#define ANADIG_PLL_SYS_PLL3_PFD_PFD1_DIV1_CLKGATE  (1 << 15)  /* Bit 15: PFD1_DIV1_CLKGATE */
#define ANADIG_PLL_SYS_PLL3_PFD_PFD2_FRAC_SHIFT    (16)       /* Bits 16-22: PFD2_FRAC */
#define ANADIG_PLL_SYS_PLL3_PFD_PFD2_FRAC_MASK     (0x3F << ANADIG_PLL_SYS_PLL3_PFD_PFD2_FRAC_SHIFT)
#define ANADIG_PLL_SYS_PLL3_PFD_PFD2_FRAC(n)       (((n) << ANADIG_PLL_SYS_PLL3_PFD_PFD2_FRAC_SHIFT) & ANADIG_PLL_SYS_PLL3_PFD_PFD2_FRAC_MASK)
#define ANADIG_PLL_SYS_PLL3_PFD_PFD2_STABLE        (1 << 22)  /* Bit 22: PFD2_STABLE */
#define ANADIG_PLL_SYS_PLL3_PFD_PFD2_DIV1_CLKGATE  (1 << 23)  /* Bit 23: PFD2_DIV1_CLKGATE */
#define ANADIG_PLL_SYS_PLL3_PFD_PFD3_FRAC_SHIFT    (24)       /* Bits 24-30: PFD3_FRAC */
#define ANADIG_PLL_SYS_PLL3_PFD_PFD3_FRAC_MASK     (0x3F << ANADIG_PLL_SYS_PLL3_PFD_PFD3_FRAC_SHIFT)
#define ANADIG_PLL_SYS_PLL3_PFD_PFD3_FRAC(n)       (((n) << ANADIG_PLL_SYS_PLL3_PFD_PFD3_FRAC_SHIFT) & ANADIG_PLL_SYS_PLL3_PFD_PFD3_FRAC_MASK)
#define ANADIG_PLL_SYS_PLL3_PFD_PFD3_STABLE        (1 << 30)  /* Bit 30: PFD3_STABLE */
#define ANADIG_PLL_SYS_PLL3_PFD_PFD3_DIV1_CLKGATE  (1 << 31)  /* Bit 31: PFD3_DIV1_CLKGATE */

/* SYS_PLL2_CTRL_REGISTER (SYS_PLL2_CTRL) */
#define ANADIG_PLL_SYS_PLL2_CTRL_PLL_REG_EN             (1 << 3)   /* Bit 3: Enable Internal PLL Regulator */
#define ANADIG_PLL_SYS_PLL2_CTRL_HOLD_RING_OFF          (1 << 11)  /* Bit 11: PLL Start up initialization */
#define ANADIG_PLL_SYS_PLL2_CTRL_ENABLE_CLK             (1 << 13)  /* Bit 13: Enable the clock output. */
#define ANADIG_PLL_SYS_PLL2_CTRL_BYPASS                 (1 << 16)  /* Bit 16: Bypass the pll. */
#define ANADIG_PLL_SYS_PLL2_CTRL_DITHER_ENABLE          (1 << 17)  /* Bit 17: DITHER_ENABLE */
#define ANADIG_PLL_SYS_PLL2_CTRL_PFD_OFFSET_EN          (1 << 18)  /* Bit 18: PFD_OFFSET_EN */
#define ANADIG_PLL_SYS_PLL2_CTRL_PLL_DDR_OVERRIDE       (1 << 19)  /* Bit 19: PLL_DDR_OVERRIDE */
#define ANADIG_PLL_SYS_PLL2_CTRL_POWERUP                (1 << 23)  /* Bit 23: Powers up the PLL. */
#define ANADIG_PLL_SYS_PLL2_CTRL_SYS_PLL2_STABLE        (1 << 29)  /* Bit 29: SYS_PLL2_STABLE */
#define ANADIG_PLL_SYS_PLL2_CTRL_SYS_PLL2_GATE          (1 << 30)  /* Bit 30: SYS_PLL2_GATE */
#define ANADIG_PLL_SYS_PLL2_CTRL_SYS_PLL2_CONTROL_MODE  (1 << 31)  /* Bit 31: SYS_PLL2_control_mode */

/* SYS_PLL2_UPDATE_REGISTER (SYS_PLL2_UPDATE) */
#define ANADIG_PLL_SYS_PLL2_UPDATE_PFD0_UPDATE        (1 << 1)  /* Bit 1: PFD0_UPDATE */
#define ANADIG_PLL_SYS_PLL2_UPDATE_PFD1_UPDATE        (1 << 2)  /* Bit 2: PFD1_UPDATE */
#define ANADIG_PLL_SYS_PLL2_UPDATE_PFD2_UPDATE        (1 << 3)  /* Bit 3: PFD2_UPDATE */
#define ANADIG_PLL_SYS_PLL2_UPDATE_PFD3_UPDATE        (1 << 4)  /* Bit 4: PFD3_UPDATE */
#define ANADIG_PLL_SYS_PLL2_UPDATE_PFD0_CONTROL_MODE  (1 << 5)  /* Bit 5: pfd0_control_mode */
#define ANADIG_PLL_SYS_PLL2_UPDATE_PFD1_CONTROL_MODE  (1 << 6)  /* Bit 6: pfd1_control_mode */
#define ANADIG_PLL_SYS_PLL2_UPDATE_PFD2_CONTROL_MODE  (1 << 7)  /* Bit 7: pfd2_control_mode */
#define ANADIG_PLL_SYS_PLL2_UPDATE_PFD3_CONTROL_MODE  (1 << 8)  /* Bit 8: pfd3_control_mode */

/* SYS_PLL2_SS_REGISTER (SYS_PLL2_SS) */
#define ANADIG_PLL_SYS_PLL2_SS_STEP_SHIFT  (0)        /* Bits 0-15: STEP */
#define ANADIG_PLL_SYS_PLL2_SS_STEP_MASK   (0x7FFF << ANADIG_PLL_SYS_PLL2_SS_STEP_SHIFT)
#define ANADIG_PLL_SYS_PLL2_SS_STEP(n)     (((n) << ANADIG_PLL_SYS_PLL2_SS_STEP_SHIFT) & ANADIG_PLL_SYS_PLL2_SS_STEP_MASK)
#define ANADIG_PLL_SYS_PLL2_SS_ENABLE      (1 << 15)  /* Bit 15: ENABLE */
#define ANADIG_PLL_SYS_PLL2_SS_STOP_SHIFT  (16)       /* Bits 16-32: STOP */
#define ANADIG_PLL_SYS_PLL2_SS_STOP_MASK   (0xFFFF << ANADIG_PLL_SYS_PLL2_SS_STOP_SHIFT)
#define ANADIG_PLL_SYS_PLL2_SS_STOP(n)     (((n) << ANADIG_PLL_SYS_PLL2_SS_STOP_SHIFT) & ANADIG_PLL_SYS_PLL2_SS_STOP_MASK)

/* SYS_PLL2_PFD_REGISTER (SYS_PLL2_PFD) */
#define ANADIG_PLL_SYS_PLL2_PFD_PFD0_FRAC_SHIFT    (0)        /* Bits 0-6: PFD0_FRAC */
#define ANADIG_PLL_SYS_PLL2_PFD_PFD0_FRAC_MASK     (0x3F << ANADIG_PLL_SYS_PLL2_PFD_PFD0_FRAC_SHIFT)
#define ANADIG_PLL_SYS_PLL2_PFD_PFD0_FRAC(n)       (((n) << ANADIG_PLL_SYS_PLL2_PFD_PFD0_FRAC_SHIFT) & ANADIG_PLL_SYS_PLL2_PFD_PFD0_FRAC_MASK)
#define ANADIG_PLL_SYS_PLL2_PFD_PFD0_STABLE        (1 << 6)   /* Bit 6: PFD0_STABLE */
#define ANADIG_PLL_SYS_PLL2_PFD_PFD0_DIV1_CLKGATE  (1 << 7)   /* Bit 7: PFD0_DIV1_CLKGATE */
#define ANADIG_PLL_SYS_PLL2_PFD_PFD1_FRAC_SHIFT    (8)        /* Bits 8-14: PFD1_FRAC */
#define ANADIG_PLL_SYS_PLL2_PFD_PFD1_FRAC_MASK     (0x3F << ANADIG_PLL_SYS_PLL2_PFD_PFD1_FRAC_SHIFT)
#define ANADIG_PLL_SYS_PLL2_PFD_PFD1_FRAC(n)       (((n) << ANADIG_PLL_SYS_PLL2_PFD_PFD1_FRAC_SHIFT) & ANADIG_PLL_SYS_PLL2_PFD_PFD1_FRAC_MASK)
#define ANADIG_PLL_SYS_PLL2_PFD_PFD1_STABLE        (1 << 14)  /* Bit 14: PFD1_STABLE */
#define ANADIG_PLL_SYS_PLL2_PFD_PFD1_DIV1_CLKGATE  (1 << 15)  /* Bit 15: PFD1_DIV1_CLKGATE */
#define ANADIG_PLL_SYS_PLL2_PFD_PFD2_FRAC_SHIFT    (16)       /* Bits 16-22: PFD2_FRAC */
#define ANADIG_PLL_SYS_PLL2_PFD_PFD2_FRAC_MASK     (0x3F << ANADIG_PLL_SYS_PLL2_PFD_PFD2_FRAC_SHIFT)
#define ANADIG_PLL_SYS_PLL2_PFD_PFD2_FRAC(n)       (((n) << ANADIG_PLL_SYS_PLL2_PFD_PFD2_FRAC_SHIFT) & ANADIG_PLL_SYS_PLL2_PFD_PFD2_FRAC_MASK)
#define ANADIG_PLL_SYS_PLL2_PFD_PFD2_STABLE        (1 << 22)  /* Bit 22: PFD2_STABLE */
#define ANADIG_PLL_SYS_PLL2_PFD_PFD2_DIV1_CLKGATE  (1 << 23)  /* Bit 23: PFD2_DIV1_CLKGATE */
#define ANADIG_PLL_SYS_PLL2_PFD_PFD3_FRAC_SHIFT    (24)       /* Bits 24-30: PFD3_FRAC */
#define ANADIG_PLL_SYS_PLL2_PFD_PFD3_FRAC_MASK     (0x3F << ANADIG_PLL_SYS_PLL2_PFD_PFD3_FRAC_SHIFT)
#define ANADIG_PLL_SYS_PLL2_PFD_PFD3_FRAC(n)       (((n) << ANADIG_PLL_SYS_PLL2_PFD_PFD3_FRAC_SHIFT) & ANADIG_PLL_SYS_PLL2_PFD_PFD3_FRAC_MASK)
#define ANADIG_PLL_SYS_PLL2_PFD_PFD3_STABLE        (1 << 30)  /* Bit 30: PFD3_STABLE */
#define ANADIG_PLL_SYS_PLL2_PFD_PFD3_DIV1_CLKGATE  (1 << 31)  /* Bit 31: PFD3_DIV1_CLKGATE */

/* SYS_PLL2_MFD_REGISTER (SYS_PLL2_MFD) */
#define ANADIG_PLL_SYS_PLL2_MFD_MFD_SHIFT  (0)  /* Bits 0-30: Denominator */
#define ANADIG_PLL_SYS_PLL2_MFD_MFD_MASK   (0x3FFFFFFF << ANADIG_PLL_SYS_PLL2_MFD_MFD_SHIFT)
#define ANADIG_PLL_SYS_PLL2_MFD_MFD(n)     (((n) << ANADIG_PLL_SYS_PLL2_MFD_MFD_SHIFT) & ANADIG_PLL_SYS_PLL2_MFD_MFD_MASK)

/* SYS_PLL1_SS_REGISTER (SYS_PLL1_SS) */
#define ANADIG_PLL_SYS_PLL1_SS_STEP_SHIFT  (0)        /* Bits 0-15: STEP */
#define ANADIG_PLL_SYS_PLL1_SS_STEP_MASK   (0x7FFF << ANADIG_PLL_SYS_PLL1_SS_STEP_SHIFT)
#define ANADIG_PLL_SYS_PLL1_SS_STEP(n)     (((n) << ANADIG_PLL_SYS_PLL1_SS_STEP_SHIFT) & ANADIG_PLL_SYS_PLL1_SS_STEP_MASK)
#define ANADIG_PLL_SYS_PLL1_SS_ENABLE      (1 << 15)  /* Bit 15: ENABLE */
#define ANADIG_PLL_SYS_PLL1_SS_STOP_SHIFT  (16)       /* Bits 16-32: STOP */
#define ANADIG_PLL_SYS_PLL1_SS_STOP_MASK   (0xFFFF << ANADIG_PLL_SYS_PLL1_SS_STOP_SHIFT)
#define ANADIG_PLL_SYS_PLL1_SS_STOP(n)     (((n) << ANADIG_PLL_SYS_PLL1_SS_STOP_SHIFT) & ANADIG_PLL_SYS_PLL1_SS_STOP_MASK)

/* SYS_PLL1_CTRL_REGISTER (SYS_PLL1_CTRL) */
#define ANADIG_PLL_SYS_PLL1_CTRL_ENABLE_CLK                  (1 << 13)  /* Bit 13: ENABLE_CLK */
#define ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_GATE               (1 << 14)  /* Bit 14: SYS_PLL1_GATE */
#define ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_DIV2               (1 << 25)  /* Bit 25: SYS_PLL1_DIV2 */
#define ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_DIV5               (1 << 26)  /* Bit 26: SYS_PLL1_DIV5 */
#define ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_DIV5_CONTROL_MODE  (1 << 27)  /* Bit 27: SYS_PLL1_DIV5_CONTROL_MODE */
#define ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_DIV2_CONTROL_MODE  (1 << 28)  /* Bit 28: SYS_PLL1_DIV2_CONTROL_MODE */
#define ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_STABLE             (1 << 29)  /* Bit 29: SYS_PLL1_STABLE */
#define ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_AI_BUSY            (1 << 30)  /* Bit 30: SYS_PLL1_AI_BUSY */
#define ANADIG_PLL_SYS_PLL1_CTRL_SYS_PLL1_CONTROL_MODE       (1 << 31)  /* Bit 31: SYS_PLL1_CONTROL_MODE */

