apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_pll.h
/* SYS_PLL1_DENOMINATOR_REGISTER (SYS_PLL1_DENOMINATOR) */
#define ANADIG_PLL_SYS_PLL1_DENOMINATOR_DENOM_SHIFT  (0)  /* Bits 0-30: DENOM */
#define ANADIG_PLL_SYS_PLL1_DENOMINATOR_DENOM_MASK   (0x3FFFFFFF << ANADIG_PLL_SYS_PLL1_DENOMINATOR_DENOM_SHIFT)
#define ANADIG_PLL_SYS_PLL1_DENOMINATOR_DENOM(n)     (((n) << ANADIG_PLL_SYS_PLL1_DENOMINATOR_DENOM_SHIFT) & ANADIG_PLL_SYS_PLL1_DENOMINATOR_DENOM_MASK)

/* SYS_PLL1_NUMERATOR_REGISTER (SYS_PLL1_NUMERATOR) */
#define ANADIG_PLL_SYS_PLL1_NUMERATOR_NUM_SHIFT  (0)  /* Bits 0-30: NUM */
#define ANADIG_PLL_SYS_PLL1_NUMERATOR_NUM_MASK   (0x3FFFFFFF << ANADIG_PLL_SYS_PLL1_NUMERATOR_NUM_SHIFT)
#define ANADIG_PLL_SYS_PLL1_NUMERATOR_NUM(n)     (((n) << ANADIG_PLL_SYS_PLL1_NUMERATOR_NUM_SHIFT) & ANADIG_PLL_SYS_PLL1_NUMERATOR_NUM_MASK)

/* SYS_PLL1_DIV_SELECT_REGISTER (SYS_PLL1_DIV_SELECT) */
#define ANADIG_PLL_SYS_PLL1_DIV_SELECT_DIV_SELECT_SHIFT  (0)  /* Bits 0-7: DIV_SELECT */
#define ANADIG_PLL_SYS_PLL1_DIV_SELECT_DIV_SELECT_MASK   (0x7F << ANADIG_PLL_SYS_PLL1_DIV_SELECT_DIV_SELECT_SHIFT)
#define ANADIG_PLL_SYS_PLL1_DIV_SELECT_DIV_SELECT(n)     (((n) << ANADIG_PLL_SYS_PLL1_DIV_SELECT_DIV_SELECT_SHIFT) & ANADIG_PLL_SYS_PLL1_DIV_SELECT_DIV_SELECT_MASK)

/* PLL_AUDIO_CTRL_REGISTER (PLL_AUDIO_CTRL) */
#define ANADIG_PLL_PLL_AUDIO_CTRL_ENABLE_CLK              (1 << 13)  /* Bit 13: ENABLE_CLK */
#define ANADIG_PLL_PLL_AUDIO_CTRL_PLL_AUDIO_GATE          (1 << 14)  /* Bit 14: PLL_AUDIO_GATE */
#define ANADIG_PLL_PLL_AUDIO_CTRL_PLL_AUDIO_STABLE        (1 << 29)  /* Bit 29: PLL_AUDIO_STABLE */
#define ANADIG_PLL_PLL_AUDIO_CTRL_PLL_AUDIO_AI_BUSY       (1 << 30)  /* Bit 30: pll_audio_ai_busy */
#define ANADIG_PLL_PLL_AUDIO_CTRL_PLL_AUDIO_CONTROL_MODE  (1 << 31)  /* Bit 31: pll_audio_control_mode */

/* PLL_AUDIO_SS_REGISTER (PLL_AUDIO_SS) */
#define ANADIG_PLL_PLL_AUDIO_SS_STEP_SHIFT  (0)        /* Bits 0-15: STEP */
#define ANADIG_PLL_PLL_AUDIO_SS_STEP_MASK   (0x7FFF << ANADIG_PLL_PLL_AUDIO_SS_STEP_SHIFT)
#define ANADIG_PLL_PLL_AUDIO_SS_STEP(n)     (((n) << ANADIG_PLL_PLL_AUDIO_SS_STEP_SHIFT) & ANADIG_PLL_PLL_AUDIO_SS_STEP_MASK)
#define ANADIG_PLL_PLL_AUDIO_SS_ENABLE      (1 << 15)  /* Bit 15: ENABLE */
#define ANADIG_PLL_PLL_AUDIO_SS_STOP_SHIFT  (16)       /* Bits 16-32: STOP */
#define ANADIG_PLL_PLL_AUDIO_SS_STOP_MASK   (0xFFFF << ANADIG_PLL_PLL_AUDIO_SS_STOP_SHIFT)
#define ANADIG_PLL_PLL_AUDIO_SS_STOP(n)     (((n) << ANADIG_PLL_PLL_AUDIO_SS_STOP_SHIFT) & ANADIG_PLL_PLL_AUDIO_SS_STOP_MASK)

/* PLL_AUDIO_DENOMINATOR_REGISTER (PLL_AUDIO_DENOMINATOR) */
#define ANADIG_PLL_PLL_AUDIO_DENOMINATOR_DENOM_SHIFT  (0)  /* Bits 0-30: DENOM */
#define ANADIG_PLL_PLL_AUDIO_DENOMINATOR_DENOM_MASK   (0x3FFFFFFF << ANADIG_PLL_PLL_AUDIO_DENOMINATOR_DENOM_SHIFT)
#define ANADIG_PLL_PLL_AUDIO_DENOMINATOR_DENOM(n)     (((n) << ANADIG_PLL_PLL_AUDIO_DENOMINATOR_DENOM_SHIFT) & ANADIG_PLL_PLL_AUDIO_DENOMINATOR_DENOM_MASK)

/* PLL_AUDIO_NUMERATOR_REGISTER (PLL_AUDIO_NUMERATOR) */
#define ANADIG_PLL_PLL_AUDIO_NUMERATOR_NUM_SHIFT  (0)  /* Bits 0-30: NUM */
#define ANADIG_PLL_PLL_AUDIO_NUMERATOR_NUM_MASK   (0x3FFFFFFF << ANADIG_PLL_PLL_AUDIO_NUMERATOR_NUM_SHIFT)
#define ANADIG_PLL_PLL_AUDIO_NUMERATOR_NUM(n)     (((n) << ANADIG_PLL_PLL_AUDIO_NUMERATOR_NUM_SHIFT) & ANADIG_PLL_PLL_AUDIO_NUMERATOR_NUM_MASK)

/* PLL_AUDIO_DIV_SELECT_REGISTER (PLL_AUDIO_DIV_SELECT) */
#define ANADIG_PLL_PLL_AUDIO_DIV_SELECT_PLL_AUDIO_DIV_SELECT_SHIFT  (0)  /* Bits 0-7: PLL_AUDIO_DIV_SELECT */
#define ANADIG_PLL_PLL_AUDIO_DIV_SELECT_PLL_AUDIO_DIV_SELECT_MASK   (0x7F << ANADIG_PLL_PLL_AUDIO_DIV_SELECT_PLL_AUDIO_DIV_SELECT_SHIFT)
#define ANADIG_PLL_PLL_AUDIO_DIV_SELECT_PLL_AUDIO_DIV_SELECT(n)     (((n) << ANADIG_PLL_PLL_AUDIO_DIV_SELECT_PLL_AUDIO_DIV_SELECT_SHIFT) & ANADIG_PLL_PLL_AUDIO_DIV_SELECT_PLL_AUDIO_DIV_SELECT_MASK)

/* PLL_VIDEO_CTRL_REGISTER (PLL_VIDEO_CTRL) */
#define ANADIG_PLL_PLL_VIDEO_CTRL_ENABLE_CLK              (1 << 13)  /* Bit 13: ENABLE_CLK */
#define ANADIG_PLL_PLL_VIDEO_CTRL_PLL_VIDEO_GATE          (1 << 14)  /* Bit 14: PLL_VIDEO_GATE */
#define ANADIG_PLL_PLL_VIDEO_CTRL_PLL_VIDEO_COUNTER_CLR   (1 << 24)  /* Bit 24: pll_video_counter_clr */
#define ANADIG_PLL_PLL_VIDEO_CTRL_PLL_VIDEO_STABLE        (1 << 29)  /* Bit 29: PLL_VIDEO_STABLE */
#define ANADIG_PLL_PLL_VIDEO_CTRL_PLL_VIDEO_AI_BUSY       (1 << 30)  /* Bit 30: pll_video_ai_busy */
#define ANADIG_PLL_PLL_VIDEO_CTRL_PLL_VIDEO_CONTROL_MODE  (1 << 31)  /* Bit 31: pll_video_control_mode */

/* PLL_VIDEO_SS_REGISTER (PLL_VIDEO_SS) */
#define ANADIG_PLL_PLL_VIDEO_SS_STEP_SHIFT  (0)        /* Bits 0-15: STEP */
#define ANADIG_PLL_PLL_VIDEO_SS_STEP_MASK   (0x7FFF << ANADIG_PLL_PLL_VIDEO_SS_STEP_SHIFT)
#define ANADIG_PLL_PLL_VIDEO_SS_STEP(n)     (((n) << ANADIG_PLL_PLL_VIDEO_SS_STEP_SHIFT) & ANADIG_PLL_PLL_VIDEO_SS_STEP_MASK)
#define ANADIG_PLL_PLL_VIDEO_SS_ENABLE      (1 << 15)  /* Bit 15: ENABLE */
#define ANADIG_PLL_PLL_VIDEO_SS_STOP_SHIFT  (16)       /* Bits 16-32: STOP */
#define ANADIG_PLL_PLL_VIDEO_SS_STOP_MASK   (0xFFFF << ANADIG_PLL_PLL_VIDEO_SS_STOP_SHIFT)
#define ANADIG_PLL_PLL_VIDEO_SS_STOP(n)     (((n) << ANADIG_PLL_PLL_VIDEO_SS_STOP_SHIFT) & ANADIG_PLL_PLL_VIDEO_SS_STOP_MASK)

/* PLL_VIDEO_DENOMINATOR_REGISTER (PLL_VIDEO_DENOMINATOR) */
#define ANADIG_PLL_PLL_VIDEO_DENOMINATOR_DENOM_SHIFT  (0)  /* Bits 0-30: DENOM */
#define ANADIG_PLL_PLL_VIDEO_DENOMINATOR_DENOM_MASK   (0x3FFFFFFF << ANADIG_PLL_PLL_VIDEO_DENOMINATOR_DENOM_SHIFT)
#define ANADIG_PLL_PLL_VIDEO_DENOMINATOR_DENOM(n)     (((n) << ANADIG_PLL_PLL_VIDEO_DENOMINATOR_DENOM_SHIFT) & ANADIG_PLL_PLL_VIDEO_DENOMINATOR_DENOM_MASK)

/* PLL_VIDEO_NUMERATOR_REGISTER (PLL_VIDEO_NUMERATOR) */
#define ANADIG_PLL_PLL_VIDEO_NUMERATOR_NUM_SHIFT  (0)  /* Bits 0-30: NUM */
#define ANADIG_PLL_PLL_VIDEO_NUMERATOR_NUM_MASK   (0x3FFFFFFF << ANADIG_PLL_PLL_VIDEO_NUMERATOR_NUM_SHIFT)
#define ANADIG_PLL_PLL_VIDEO_NUMERATOR_NUM(n)     (((n) << ANADIG_PLL_PLL_VIDEO_NUMERATOR_NUM_SHIFT) & ANADIG_PLL_PLL_VIDEO_NUMERATOR_NUM_MASK)

/* PLL_VIDEO_DIV_SELECT_REGISTER (PLL_VIDEO_DIV_SELECT) */
#define ANADIG_PLL_PLL_VIDEO_DIV_SELECT_DIV_SELECT_SHIFT  (0)  /* Bits 0-7: DIV_SELECT */
#define ANADIG_PLL_PLL_VIDEO_DIV_SELECT_DIV_SELECT_MASK   (0x7F << ANADIG_PLL_PLL_VIDEO_DIV_SELECT_DIV_SELECT_SHIFT)
#define ANADIG_PLL_PLL_VIDEO_DIV_SELECT_DIV_SELECT(n)     (((n) << ANADIG_PLL_PLL_VIDEO_DIV_SELECT_DIV_SELECT_SHIFT) & ANADIG_PLL_PLL_VIDEO_DIV_SELECT_DIV_SELECT_MASK)

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_PLL_H */
